; domain
(define (domain mprime_x_25-domain)
 (:requirements :strips :typing :numeric-fluents)
 (:types
    food emotion - object
    pleasure pain - emotion
 )
 (:predicates (eats ?n1 - food ?n2 - food) (craves ?v - emotion ?n - food) (fears ?c - pain ?v_0 - pleasure))
 (:functions (harmony ?v - emotion) (locale ?n - food))
 (:action overcome
  :parameters ( ?c - pain ?v_0 - pleasure ?n - food)
  :precondition (and (craves ?c ?n) (craves ?v_0 ?n) (<= 1 (harmony ?v_0)))
  :effect (and (not (craves ?c ?n)) (fears ?c ?v_0) (decrease (harmony ?v_0) 1)))
 (:action feast
  :parameters ( ?v_0 - pleasure ?n1 - food ?n2 - food)
  :precondition (and (craves ?v_0 ?n1) (eats ?n1 ?n2) (<= 1 (locale ?n1)))
  :effect (and (not (craves ?v_0 ?n1)) (craves ?v_0 ?n2) (decrease (locale ?n1) 1)))
 (:action succumb
  :parameters ( ?c - pain ?v_0 - pleasure ?n - food)
  :precondition (and (fears ?c ?v_0) (craves ?v_0 ?n))
  :effect (and (not (fears ?c ?v_0)) (craves ?c ?n) (increase (harmony ?v_0) 1)))
 (:action drink
  :parameters ( ?n1 - food ?n2 - food)
  :precondition (and (<= 1 (locale ?n1)))
  :effect (and (decrease (locale ?n1) 1) (increase (locale ?n2) 1)))
)

; problem
(define (problem mprime_x_25-problem)
 (:domain mprime_x_25-domain)
 (:objects
   wurst tuna pistachio chicken - food
   expectation rest - pleasure
   depression angina - pain
 )
 (:init (eats wurst chicken) (eats tuna pistachio) (craves angina chicken) (eats chicken pistachio) (craves rest pistachio) (= (locale tuna) 2) (eats chicken wurst) (= (harmony expectation) 1) (craves expectation tuna) (craves depression wurst) (eats pistachio wurst) (eats tuna wurst) (= (locale wurst) 2) (eats pistachio tuna) (eats wurst tuna) (= (harmony rest) 3) (eats wurst pistachio) (eats pistachio chicken) (= (locale chicken) 2) (= (locale pistachio) 5))
 (:goal (and (craves depression chicken)))
)

; plan
1. (feast expectation tuna wurst)
   deleted: (craves expectation tuna)
   added: (craves expectation wurst)
   changed: (locale tuna) from 2 to 1
   goals met: 0 of 1
2. (overcome depression expectation wurst)
   deleted: (craves depression wurst)
   added: (fears depression expectation)
   changed: (harmony expectation) from 1 to 0
   goals met: 0 of 1
3. (feast expectation wurst chicken)
   deleted: (craves expectation wurst)
   added: (craves expectation chicken)
   changed: (locale wurst) from 2 to 1
   goals met: 0 of 1
4. (succumb depression expectation chicken)
   deleted: (fears depression expectation)
   added: (craves depression chicken)
   changed: (harmony expectation) from 0 to 1
   goals met: 1 of 1
